bogdanm/eLuaBrain/src/platform/stm32/platform.c
  // Reset pins
  GPIO_InitStructure.GPIO_Pin = spi_gpio_pins[ SPI_ID ];
  GPIO_InitStructure.GPIO_Speed = GPIO_Speed_50MHz;
  GPIO_InitStructure.GPIO_Mode = GPIO_Mode_IN_FLOATING;
  GPIO_Init(spi_gpio_port[ SPI_ID ], &GPIO_InitStructure);   
}

static void vram_transfer_init()
{
  EXTI_InitTypeDef exti; 
    
  // Enable pullups on request line
  platform_pio_op( REQ_PORT, 1 << REQ_LINE, PLATFORM_IO_PIN_PULLUP );
  
  // Set 1 on the CS line (but don't enable it yet!)
  platform_pio_op( CS_PORT, 1 << CS_LINE, PLATFORM_IO_PIN_SET );
  
  // Enable EXTI interrupt on PA1 falling edge
  EXTI_DeInit();
  exti.EXTI_Line = EXTI_Line1;
  exti.EXTI_Mode = EXTI_Mode_Interrupt;
  exti.EXTI_Trigger = EXTI_Trigger_Falling;
  exti.EXTI_LineCmd = ENABLE;
  EXTI_Init( &exti );  
  
  // Setup SPI interface
  platform_spi_setup_nopins( SPI_ID, PLATFORM_SPI_MASTER, 20000000, 0, 0, 8 );
  
  // Setup DMA
  RCC_AHBPeriphClockCmd( RCC_AHBPeriph_DMA1, ENABLE );  
  DMA_DeInit( DMA1_Channel5 );
  DMA_InitStructure.DMA_PeripheralBaseAddr = (uint32_t)SPI2_DR_Address;
  DMA_InitStructure.DMA_MemoryBaseAddr = (uint32_t)vram_data;
  DMA_InitStructure.DMA_DIR = DMA_DIR_PeripheralDST;
  DMA_InitStructure.DMA_Priority = DMA_Priority_Low;
  DMA_InitStructure.DMA_BufferSize = VRAM_SIZE_TOTAL;
  DMA_InitStructure.DMA_PeripheralInc = DMA_PeripheralInc_Disable;
  DMA_InitStructure.DMA_MemoryInc = DMA_MemoryInc_Enable;
  DMA_InitStructure.DMA_PeripheralDataSize = DMA_MemoryDataSize_Byte;
  DMA_InitStructure.DMA_MemoryDataSize = DMA_MemoryDataSize_Byte;
  DMA_InitStructure.DMA_Mode = DMA_Mode_Normal;
  DMA_InitStructure.DMA_M2M = DMA_M2M_Disable;
  DMA_Init( DMA1_Channel5, &DMA_InitStructure );     	
  
  // Timing pin (remove this)
  platform_pio_op( TIME_PORT, 1 << TIME_PIN, PLATFORM_IO_PIN_CLEAR );
  platform_pio_op( TIME_PORT, 1 << TIME_PIN, PLATFORM_IO_PIN_DIR_OUTPUT );  
}
